Revit 2024 API
RevitLinkType.GetConversionData Method
 Returns the optional data that is necessary to generate the Revit file for this link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public LinkConversionData GetConversionData()
Visual Basic
Public Function GetConversionData As LinkConversionData
Visual C++
public:
LinkConversionData^ GetConversionData()
Return Value
 The RvtLinkConversionData containing the necessary information.
See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace